In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import numpy as np 
import pandas as pd

# 데이타프레임 생성 

- 딕셔너리 + 리스트 => 데이타프레임 
- 딕셔너리 + 딕셔너리  => 데이타프레임 
- 2차원 리스트  => 데이타프레임 
- 2차원 넘파이배열 => 데이타프레임 
- 2개이상의 시리즈  => 데이타프레임 

```
pd.DataFrame(데이타, columns=컬럼명리스트, index=인덱스리스트)
```

##### 2차원 리스트 => 데이타프레임

In [3]:
data = [ ['Elise', 1.5, 2014],
         ['Julia', 1.7, 2015],
         ['Jhon', 3.6, 2016],
         ['Charles', 2.5, 2017],
         ['Charles', 2.9, 2018] ]

In [6]:
df1 = pd.DataFrame(data, 
                   columns = ['name', 'score', 'year'],
                   index = range(10, 51, 10))
df1

       name  score  year
10    Elise    1.5  2014
20    Julia    1.7  2015
30     Jhon    3.6  2016
40  Charles    2.5  2017
50  Charles    2.9  2018

In [8]:
# 컬럼명 변경 
# 데이타프레임명.columns = 리스트
df1.columns = ['name', 'grade', 'std_id']

In [9]:
df1

       name  grade  std_id
10    Elise    1.5    2014
20    Julia    1.7    2015
30     Jhon    3.6    2016
40  Charles    2.5    2017
50  Charles    2.9    2018

In [ ]:
# 인덱스명 수정 
# 데이타프레임명.index = 리스트/range()/넘파이배열

In [10]:
df1.index = np.arange(100, 501, 100)

In [11]:
df1

        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018

#### 2차원 넘파이배열 => 데이타프레임

In [15]:
data = np.random.randint(1,100,50).reshape(-1,5)
data

array([[29, 48, 60, 30, 23],
       [19, 17, 24, 99, 98],
       [82,  6, 45, 97, 80],
       [99, 72, 64, 77, 71],
       [92, 51, 28, 53, 76],
       [14, 13, 20, 83, 38],
       [45, 93, 10,  4, 89],
       [41, 92, 50,  8,  1],
       [14, 79, 86, 18,  2],
       [ 8, 95, 46, 12, 59]])

In [16]:
df2 = pd.DataFrame(data)
df2

    0   1   2   3   4
0  29  48  60  30  23
1  19  17  24  99  98
2  82   6  45  97  80
3  99  72  64  77  71
4  92  51  28  53  76
5  14  13  20  83  38
6  45  93  10   4  89
7  41  92  50   8   1
8  14  79  86  18   2
9   8  95  46  12  59

In [22]:
# 리스트 for
# [최종값 for i in range(start, end, step)]
[i for i in range(1, 6)]

[1, 2, 3, 4, 5]

In [23]:
df2.columns = ['col' + str(i) for i in range(1, 6)]
df2.index = ['row' + str(i) for i in range(1, 11)]

In [24]:
df2

       col1  col2  col3  col4  col5
row1     29    48    60    30    23
row2     19    17    24    99    98
row3     82     6    45    97    80
row4     99    72    64    77    71
row5     92    51    28    53    76
row6     14    13    20    83    38
row7     45    93    10     4    89
row8     41    92    50     8     1
row9     14    79    86    18     2
row10     8    95    46    12    59

In [17]:
range(1, 11)

range(1, 11)

##### 딕셔너리 리스트 => 데이타프레임 

- 딕셔너리 리스트란?
<br> 딕셔너리의 값이 리스트인 형태 

- 딕셔너리 키가 컬럼명, 딕셔너리 값은 컬럼값 
- 딕셔너리의 값으로 사용되는 리스트의 길이가 같아야한다.

In [28]:
data = {    "name":['Elise', 'Julia', 'Jhon', 'Charles', 'Charles'],
            # "year":[2014, 2015, 2016, 2017, 2018, 2019], # Value Error
            "year":[2014, 2015, 2016, 2017, 2018],
            "points":[1.5, 1.7, 3.6, 2.5, 2.9]}
df3 = pd.DataFrame(data)

In [26]:
df3

      name  year  points
0    Elise  2014     1.5
1    Julia  2015     1.7
2     Jhon  2016     3.6
3  Charles  2017     2.5
4  Charles  2018     2.9

##### 이중 딕셔너리(Nested Dictionary)  => 데이타프레임 

- 이중 딕셔너리(Nested Dictionary)?
<br> 딕셔너리의 값이 딕셔너리인 형태 

- 딕셔너리 키가 컬럼명
- 딕셔너리 값에 있는 딕셔너리의 키는 행이름으로 적용

In [32]:
data = { 'Nevada':{ 2001:2.4, 2002:2.9 },
          'Ohio':{ 2000:1.5, 2001:1.7, 2002:3.6 }, 
           'LA':{ 2003:3.3, 2002:3.6, 2001:1.7,  2000:2.2 } }

In [33]:
df4 = pd.DataFrame(data)
df4

      Nevada  Ohio   LA
2001     2.4   1.7  1.7
2002     2.9   3.6  3.6
2000     NaN   1.5  2.2
2003     NaN   NaN  3.3

##### 시리즈의 조합  => 데이타프레임 

pd.DataFrame([시리즈1, 시리즈2...])

In [39]:
s1 = pd.Series({'a':'apple', 'b':'banana', 'c':'cat', 'd':'drama'})
s2 = pd.Series({'a':'apart', 'b':'bat', 'c':'cartoon'})

In [40]:
s1

a     apple
b    banana
c       cat
d     drama
dtype: object

In [37]:
s2

a      apart
b        bat
c    cartoon
dtype: object

In [41]:
df5 = pd.DataFrame([s1, s2])
df5

       a       b        c      d
0  apple  banana      cat  drama
1  apart     bat  cartoon    NaN

# 데이타프레임 속성 

```
데이타프레임의 행 요소 조회 – 데이타프레임이름.index
데이타프레임의 열 요소 조회 – 데이타프레임이름.columns
데이타프레임의 요소 값 조회 – 데이타프레임이름.values
데이타프레임의 전체구조 – 데이타프레임이름.shape
```

In [51]:
print(df1)
print()
print(df1.index)
print(df1.columns)
print()
print(df1.values)
print()
print(df1.shape)

        name  grade  std_id
100    Elise    1.5    2014
200    Julia    1.7    2015
300     Jhon    3.6    2016
400  Charles    2.5    2017
500  Charles    2.9    2018

Int64Index([100, 200, 300, 400, 500], dtype='int64')
Index(['name', 'grade', 'std_id'], dtype='object')

[['Elise' 1.5 2014]
 ['Julia' 1.7 2015]
 ['Jhon' 3.6 2016]
 ['Charles' 2.5 2017]
 ['Charles' 2.9 2018]]

(5, 3)

In [47]:
print(df2)
print()
print(df2.index)

       col1  col2  col3  col4  col5
row1     29    48    60    30    23
row2     19    17    24    99    98
row3     82     6    45    97    80
row4     99    72    64    77    71
row5     92    51    28    53    76
row6     14    13    20    83    38
row7     45    93    10     4    89
row8     41    92    50     8     1
row9     14    79    86    18     2
row10     8    95    46    12    59

Index(['row1', 'row2', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9',
       'row10'],
      dtype='object')

##### 인덱스대표이름과 컬럼대표이름  지정 
- index.name
- columns.name

In [53]:
df2.index.name = "Num"
df2.columns.name = "Info"
df2

Info   col1  col2  col3  col4  col5
Num
row1     29    48    60    30    23
row2     19    17    24    99    98
row3     82     6    45    97    80
row4     99    72    64    77    71
row5     92    51    28    53    76
row6     14    13    20    83    38
row7     45    93    10     4    89
row8     41    92    50     8     1
row9     14    79    86    18     2
row10     8    95    46    12    59

#### 데이타프레임 정보 확인 
- 전체갯수, 결측치, 구조, 데이타형태, 통계(편차, 사분위, 평균) 
- 데이타프레임.describe()
- 데이타프레임.info()
- 데이타프레임.dtypes

In [55]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, row1 to row10
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     int32
 1   col2    10 non-null     int32
 2   col3    10 non-null     int32
 3   col4    10 non-null     int32
 4   col5    10 non-null     int32
dtypes: int32(5)
memory usage: 280.0+ bytes

In [56]:
df2.describe()

Info        col1       col2       col3       col4       col5
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   44.300000  56.600000  43.300000  48.100000  53.700000
std    34.525514  34.843141  23.199856  38.222884  35.534178
min     8.000000   6.000000  10.000000   4.000000   1.000000
25%    15.250000  24.750000  25.000000  13.500000  26.750000
50%    35.000000  61.500000  45.500000  41.500000  65.000000
75%    72.750000  88.750000  57.500000  81.500000  79.000000
max    99.000000  95.000000  86.000000  99.000000  98.000000

In [54]:
df2

Info   col1  col2  col3  col4  col5
Num
row1     29    48    60    30    23
row2     19    17    24    99    98
row3     82     6    45    97    80
row4     99    72    64    77    71
row5     92    51    28    53    76
row6     14    13    20    83    38
row7     45    93    10     4    89
row8     41    92    50     8     1
row9     14    79    86    18     2
row10     8    95    46    12    59

In [57]:
df3

      name  year  points
0    Elise  2014     1.5
1    Julia  2015     1.7
2     Jhon  2016     3.6
3  Charles  2017     2.5
4  Charles  2018     2.9

In [58]:
df3.describe()

              year   points
count     5.000000  5.00000
mean   2016.000000  2.44000
std       1.581139  0.86487
min    2014.000000  1.50000
25%    2015.000000  1.70000
50%    2016.000000  2.50000
75%    2017.000000  2.90000
max    2018.000000  3.60000

In [60]:
# 각 컬럼의 데이타형 확인 
df3.dtypes

name       object
year        int64
points    float64
dtype: object